<?php
/**
 * Created by PhpStorm.
 * User: Admin
 * Date: 18.12.2016
 * Time: 20:55
 */

$location_array = [
'Москва',
'Белгородская область',
'Брянская область',
'Владимирская область',
'Воронежская область',
'Ивановская область',
'Калужская область',
'Костромская область',
'Курская область',
'Липецкая область',
'Московская область',
'Орловская область',
'Рязанская область',
'Смоленская область',
'Тамбовская область',
'Тверская область',
'Тульская область',
'Ярославская область',
'Санкт-Петербург',
'Республика Карелия',
'Республика Коми',
'Архангельская область',
'Вологодская область',
'Калининградская область',
'Ленинградская область',
'Мурманская область',
'Новгородская область',
'Псковская область',
'Ненецкий автономный округ',
'Республика Адыгея',
'Республика Калмыкия',
'Республика Крым',
'Краснодарский край',
'Астраханская область',
'Волгоградская область',
'Ростовская область',
'Республика Дагестан',
'Республика Ингушетия',
'Кабардино-Балкарская Республика',
'Карачаево-Черкесская Республика',
'Республика Северная Осетия',
'Чеченская Республика',
'Ставропольский край',
'Республика Башкортостан',
'Республика Марий Эл',
'Республика Мордовия',
'Республика Татарстан',
'Удмуртская Республика',
'Чувашская Республика',
'Пермский край',
'Кировская область',
'Нижегородская область',
'Оренбургская область',
'Пензенская область',
'Самарская область',
'Саратовская область',
'Ульяновская область',
'Курганская область',
'Свердловская область',
'Тюменская область',
'Челябинская область',
'Ханты-Мансийский автономный округ',
'Ямало-Ненецкий автономный округ',
'Республика Алтай',
'Республика Бурятия',
'Республика Тыва',
'Республика Хакасия',
'Алтайский край',
'Забайкальский край',
'Красноярский край',
'Иркутская область',
'Кемеровская область',
'Новосибирская область',
'Омская область',
'Томская область',
'Республика Саха (Якутия)',
'Камчатский край',
'Приморский край',
'Хабаровский край',
'Амурская область',
'Магаданская область',
'Сахалинская область',
'Еврейская автономная область',
'Чукотский автономный округ'];
$start_years = [ //даем массив соответствия стартового месяца стартовуму году
	1 => 2001,
	13 => 2002,
	25 => 2003,
	37 => 2004,
	49 => 2005,
	61 => 2006,
	73 => 2007,
	85 => 2008,
	97 => 2009,
	109 => 2010,
	121 => 2011,
	133 => 2012,
	145 => 2013,
	157 => 2014,
	169 => 2015,
	181 => 2016
	];
$end_years = [ //даем массив соответствия финального месяца финальному году - потом это можно бдует получать из базы
	12 => 2001,
	24 => 2002,
	36 => 2003,
	48 => 2004,
	60 => 2005,
	72 => 2006,
	84 => 2007,
	96 => 2008,
	108 => 2009,
	120 => 2010,
	132 => 2011,
	144 => 2012,
	156 => 2013,
	168 => 2014,
	180 => 2015,
	192 => 2016
	];

/*if (isset ($_POST)){
	var_dump($_POST);
    echo '<br>';
}*/

?>

<form action="fillrequest.php" method="post">
 <p>Отрасль:
	 <select name="sector">
	 <option value="1">Рога говяжьи</option>
	 <option value="2">Копыта верблюжьи</option>
	 <option value="3">Перо гусиное</option>
	 <option value="4">Хвосты свиные</option>
	 <option value="5">Кошачий корм</option>
 </select>
 </p>
 <p>Локация<select name="location">
 <?php
 foreach ($location_array as $key => $value) {
 	$a=$key+1;
 	echo '<option value="' . $a . '">' . $value . '</option>';
 }
/*
 <option value="CFO">ЦФО</option>
 <option value="SZFO">СЗФО</option>
 <option value="PFO">ПФО</option>
 <option value="SKFO">СКФО</option>
 <option value="DFO">ДФО</option>
 <option value="FFO">ФФО</option>*/
 ?>
 </select>
 </p>
 <p> Дата с:<select name="date_begin">
  <?php
 foreach ($start_years as $key => $value) {
 	echo '<option value="' . $key . '">' . $value . '</option>';
 }
?>
 <!-- <option value="2001">2001</option>
 <option value="2001">2002</option>
 <option value="2003">2003</option>
 <option value="2004">2004</option>
 <option value="2005">2005</option>
 <option value="2006">2006</option>
 <option value="2007">2007</option>
 <option value="2008">2008</option>
 <option value="2009">2009</option>
 <option value="2010">2010</option>
 <option value="2011">2011</option>
 <option value="2012">2012</option>
 <option value="2013">2013</option>
 <option value="2014">2014</option>
 <option value="2015">2015</option>
 <option value="2016">2016</option> -->
 </select>
 
  Дата по:<select name="date_end">
    <?php
 foreach ($end_years as $key => $value) {
 	echo '<option value="' . $key . '">' . $value . '</option>';
 }
?>
 <!-- <option value="2001">2001</option>
 <option value="2001">2002</option>
 <option value="2003">2003</option>
 <option value="2004">2004</option>
 <option value="2005">2005</option>
 <option value="2006">2006</option>
 <option value="2007">2007</option>
 <option value="2008">2008</option>
 <option value="2009">2009</option>
 <option value="2010">2010</option>
 <option value="2011">2011</option>
 <option value="2012">2012</option>
 <option value="2013">2013</option>
 <option value="2014">2014</option>
 <option value="2015">2015</option>
 <option value="2016">2016</option> -->
 </select>
 </p>
 <p><input type="submit" /></p>
</form>
<?php
